ErpTest/src/InformationRegisters/пкДополнительнаяИнформацияТехника/пкДополнительнаяИнформацияТехника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкДополнительнаяИнформацияТехника</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДопИнформацияПоТехнике</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БлокGSM</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ЗаказНаряд</name>
    <type>
      <types>DocumentRef.пкЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазблокировки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкДополнительнаяИнформацияТехника/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ТЗ = ЭтотОбъект.Выгрузить();
	Если ТЗ.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(ТЗ[0].Техника) Тогда
		Возврат;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаБлокировки КАК ПредДатаБлокировки,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.Заблокирован КАК ПредЗаблокирован,
		|	пкДополнительнаяИнформацияТехникаСрезПоследних.ДатаРазблокировки КАК ПредДатаРазблокировки
		|ИЗ
		|	РегистрСведений.пкДополнительнаяИнформацияТехника.СрезПоследних(, Техника = &Техника) КАК пкДополнительнаяИнформацияТехникаСрезПоследних";
	
	Запрос.УстановитьПараметр("Техника", ТЗ[0].Техника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат;		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.ПредЗаблокирован И ТЗ[0].Заблокирован Тогда
	
		ТЗ[0].ДатаБлокировки = ВыборкаДетальныеЗаписи.ПредДатаБлокировки;	
		
	ИначеЕсли НЕ ВыборкаДетальныеЗаписи.ПредЗаблокирован И ТЗ[0].Заблокирован	Тогда
		
		ТЗ[0].ДатаБлокировки 	= ТекущаяДата();
		ТЗ[0].ДатаРазБлокировки = Неопределено;
		
	ИначеЕсли ВыборкаДетальныеЗаписи.ПредЗаблокирован И НЕ ТЗ[0].Заблокирован	Тогда	
		
		ТЗ[0].ДатаРазБлокировки = ТекущаяДата();
		ТЗ[0].ДатаБлокировки	= Неопределено;
		
	КонецЕсли;

	ЭтотОбъект.Загрузить(ТЗ);
		
КонецПроцедуры
